Revit 2027 API
MechanicalEquipmentSet.AreElementsNotConnectedInSeries Method
 Checks if the elements are not serially connected.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AreElementsNotConnectedInSeries(
	Document document,
	ISet<ElementId> elemIds
)
Public Shared Function AreElementsNotConnectedInSeries (
	document As Document,
	elemIds As ISet(Of ElementId)
) As Boolean
public:
static bool AreElementsNotConnectedInSeries(
	Document^ document,
	ISet<ElementId^>^ elemIds
)
static member AreElementsNotConnectedInSeries :
        document : Document *
        elemIds : ISet<ElementId> -> bool
Parameters
document Document
 The document of these elements.
elemIds ISet<ElementId>
 The element ids to be tested.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace